Yachasoft.Sri.WebService/bin/Debug/net5.0/Request/ValidarComprobanteRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ec="http://ec.gob.sri.ws.recepcion">
	<soapenv:Header/>
	<soapenv:Body>
		<ec:validarComprobante>
			<!--Optional:-->
			<xml>{xmlParameter}</xml>
		</ec:validarComprobante>
	</soapenv:Body>
</soapenv:Envelope>